address = [
    ['王*龙', '北京市,海淀区', '苏州街大恒科技大厦南座4层'],
    ['庞*飞', '北京市,昌平区', '汇德商厦四楼403'],
    ['顾*锐', '江苏省,扬州市', '二垛镇工业集中区扬州市立华畜禽有限公司'],
    ['王*飞', '上海市,徐汇区', '上海市徐汇区H88越虹广场B座5E1'],
    ['华*升', '北京市,海淀区', '杰睿大厦'],
    ['朱*错', '上海市,浦东新区', '川沙新镇华川家园33号楼503'],
    ['陈*盼', '浙江省,杭州市', '闲林街道，西溪华东园，十幢一单元401'],
    ['司*鹏', '河南省,鹤壁市', '淇滨大道310号 鹤壁京立医院'],
    ['聂*睿', '河北省,石家庄市', '中山路勒泰中心写字楼b座11层'],
    ['张*', '辽宁省,本溪市', '明兴丽城九号楼四单元'],
    ['冉*晗', '河北省,石家庄市', '体育南大街385号'],
    ['高*杰', '北京市,朝阳区', '广渠路42号院3号楼408'],
    ['李*国', '安徽省,合肥市', '新站区准合花园'],
    ['常*源', '江苏省,南京市', '白下路242号,南京市红十字医院,放射科'],
    ['张*玉', '河北省,沧州市', '新居然家居广场'],
    ['王*川', '上海市,奉贤区', '南桥镇 贝港七区'],
    ['冀*庆', '河北省,保定市', '河北大学坤兴园生活区'],
    ['胡*晨', '浙江省,宁波市', '浙江省宁波市江东区中山首府A座2004室'],
    ['尹*婷', '湖北省,武汉市', '武汉大学信息学部'],
    ['李*东', '辽宁省,大连市', '大关一街3号3-3-1'],
    ['张*', '天津市,河西区', '隆昌路94号 (天津科技馆)'],
    ['刘*', '湖北省,黄冈市', '城关镇']
]

# 输出所有省市
result = {}
for item in address:
    name = item[0]
    data = item[1].split(",")
    city = data[0]
    if city in result:
        result[city].append(name)
    else:
        result[city] = [name]
print(result)

# 输出
{'北京市': ['王*龙', '庞*飞', '华*升', '高*杰'], '江苏省': ['顾*锐', '常*源'], '上海市': ['王*飞', '朱*错', '王*川'], '浙江省': ['陈*盼', '胡*晨'], '河南省': ['司*鹏'], '河北省': ['聂*睿', '冉*晗', '张*玉', '冀*庆'], '辽宁省': ['张*', '李*东'], '安徽省': ['李*国'], '湖北省': ['尹*婷', '刘*'], '天津市': ['张*']}
