color_list = ["红桃", "黑桃", "方块", "梅花"]
result = []
for i in range(1, 14):
    for item in color_list:
        card = (item, i)
        result.append(card)
print(result)

# 输出
[('红桃', 1), ('黑桃', 1), ('方块', 1), ('梅花', 1), ('红桃', 2), ('黑桃', 2), ('方块', 2), ('梅花', 2), ('红桃', 3), ('黑桃', 3), ('方块', 3), ('梅花', 3), ('红桃', 4), ('黑桃', 4), ('方块', 4), ('梅花', 4), ('红桃', 5), ('黑桃', 5), ('方块', 5), ('梅花', 5), ('红桃', 6), ('黑桃', 6), ('方块', 6), ('梅花', 6), ('红桃', 7), ('黑桃', 7), ('方块', 7), ('梅花', 7), ('红桃', 8), ('黑桃', 8), ('方块', 8), ('梅花', 8), ('红桃', 9), ('黑桃', 9), ('方块', 9), ('梅花', 9), ('红桃', 10), ('黑桃', 10), ('方块', 10), ('梅花', 10), ('红桃', 11), ('黑桃', 11), ('方块', 11), ('梅花', 11), ('红桃', 12), ('黑桃', 12), ('方块', 12), ('梅花', 12), ('红桃', 13), ('黑桃', 13), ('方块', 13), ('梅花', 13)]
